<template>
    <div id="Problem13">
  <p>Problem13</p>
        一销售系统，如果销售员的年销售额大于200万RMB且请假天数不超过10天的情况下，现金到帐大于等于60%，则佣金（提成）系数为7，即佣金值为销售额除以佣金系数；现金到帐小于60%，佣金不予计算。所有其他情况且现金到帐小于等于85%，则按佣金系数均为6计算佣金，现金到账大于85%，佣金系数按5处理。<br>
根据题意设计流程图并设计测试用例实现白盒测试（White Box Test）的1）语句覆盖，2）判断覆盖，3）条件覆盖，4）判断—条件覆盖，5）条件组合覆盖（测试用例及覆盖表示要清晰）。<br>

<img src="../../assets/img/heixin.png"/>
        （1）	语句覆盖<br>
销售额>200W&&请假天数<=10&#12288;	现金到账<br>
满足					&#12288; 			>=60%<br>
不满足				&#12288; 			>85%<br>
不满足				&#12288; 			<=85%<br>
（2）	判断覆盖<br>
销售额>200W&&请假天数<=10&#12288;	现金到账<br>
满足					&#12288; 			>=60%<br>
满足					&#12288; 			<60%<br>
不满足				&#12288; 			>85%<br>
不满足				&#12288; 			<=85%<br>
（3）	条件覆盖<br>
第一个判断的真假记为T1,F1，同理得T2,F2,T3,F3<br>
销售额>200W&&请假天数<=10&#12288;	现金到账&#12288;	覆盖条件<br>
满足					&#12288; 			>=60%	&#12288; 	T1,T2<br>
满足					&#12288; 			<60%	&#12288; 	T1,F2<br>
不满足				&#12288; 			>85%	&#12288; 	F1,T3<br>
不满足				&#12288; 			<=85%	&#12288; 	F1,F3<br>
（4）	判断-条件覆盖<br>
第一个判断的真假记为T1,F1，同理得T2,F2,T3,F3<br>
销售额>200W&&请假天数<=10&#12288;	现金到账&#12288;	覆盖条件<br>
满足					&#12288; 			>=60%	&#12288; 	T1,T2<br>
满足					&#12288; 			<60%	&#12288; 	T1,F2<br>
不满足				&#12288; 			>85%	&#12288; 	F1,T3<br>
不满足				&#12288; 			<=85%	&#12288; 	F1,F3<br>
（5）	条件组合覆盖<br>
第一个判断的真假记为T1,F1，同理得T2,F2,T3,F3<br>
销售额>200W&&请假天数<=10&#12288;	现金到账&#12288;	覆盖条件<br>
满足					&#12288; 			>=60%	&#12288; 	T1,T2<br>
满足					&#12288; 			<60%	&#12288; 	T1,F2<br>
不满足				&#12288; 			>85%	&#12288; 	F1,T3<br>
不满足				&#12288; 			<=85%	&#12288; 	F1,F3<br>
不可能实现所有条件的组合<br>

</div>
</template>