<template>
<div id="Problem2">
  <p>Problem2</p>

    在一销售管理系统中，其中的一个模块负责对公司员工进行年终考评，考评综合考虑职工在公司工作时间长短（计年）、每年请假的次数（不能超过20天，20天以上，包括20天，则免于年终考评）、员工在公司的级别（分1，2，3，4，5个级别）及本年度的销售总额，考评的结果最高以5分计，公司成立于2000年初，该软件的设计使用周期到2025年底，请回答下列问题：<br>
    (1)	用基本边界值的测试方法，一共有多少测试用例；最坏情况边界值有多少测试用例。<br>
        基本边界值测试法取最小值、略高与最小值、正常值、略低于最大值、和最大值五个值，每次取一个变量，共有4n+1个<br>
        最坏情况边界值变量取值情况与基本编制之测试相同，但对所有变量取笛卡尔积，得到5^n个<br>
    (2)	根据健壮的边界值测试法，写出“工作时间长短”为非正常值情况下的测试用例。<br>
        健壮边界值测试除了基本的5个取值，还考虑不合法输入，共有6n+1个。<br>
    <img src="../../assets/img/problem2.png"/>
</div>
</template>